Homework/HW3-F21.org
#+BEGIN_OPTIONS
#+AUTHOR: William F. Schneider
#+TITLE: CBE 60546 Homework
#+EMAIL: wschneider@nd.edu
#+LATEX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER:\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
#+LATEX_HEADER:\geometry{margin=1.0in}
#+LATEX_HEADER:\usepackage{hyperref}
#+LATEX_HEADER:\usepackage{amsmath}
#+LATEX_HEADER:\usepackage{graphicx}
#+LATEX_HEADER:\usepackage{epstopdf}
#+LATEX_HEADER:\usepackage{fancyhdr}
#+LATEX_HEADER:\pagestyle{fancy}
#+LATEX_HEADER:\fancyhf{}
#+LATEX_HEADER:\usepackage[labelfont=bf]{caption}
#+LATEX_HEADER:\usepackage{setspace}
#+LATEX_HEADER:\setlength{\headheight}{10.2pt}
#+LATEX_HEADER:\setlength{\headsep}{20pt}
#+LATEX_HEADER:\renewcommand{\headrulewidth}{0.5pt}
#+LATEX_HEADER:\renewcommand{\footrulewidth}{0.5pt}
#+LATEX_HEADER:\lfoot{\today}
#+LATEX_HEADER:\cfoot{\copyright\ 2021 W.\ F.\ Schneider}
#+LATEX_HEADER:\rfoot{\thepage}
#+LATEX_HEADER:\chead{\bf{Advanced Chemical Reaction Engineering (CBE 60546)\vspace{12pt}}}
#+LATEX_HEADER:\lhead{\bf{Homework 3}}
#+LATEX_HEADER:\rhead{\bf{Due September 16, 2021}}
#+LATEX_HEADER:\usepackage{titlesec}
#+LATEX_HEADER:\titlespacing*{\section}
#+LATEX_HEADER:{0pt}{0.6\baselineskip}{0.2\baselineskip}
#+LATEX_HEADER:\title{University of Notre Dame\\Advanced Chemical Engineering Thermodynamics\\(CBE 60553)}
#+LATEX_HEADER:\author{Prof. William F.\ Schneider}
#+LATEX_HEADER:\usepackage{siunitx}
#+LATEX_HEADER:\usepackage[version=3]{mhchem}
#+LATEX_HEADER:\def\dbar{{\mathchar'26\mkern-12mu d}}

#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: toc:nil
#+OPTIONS: H:3 num:3
#+OPTIONS: ':t
#+END_OPTIONS

\noindent *Carefully and neatly document your answers.  You may use a mathematical solver like Jupyter/iPython. Use plotting software for all plots.*

* Key ideas                                                        :noexport:
- rates laws
- half-lives
- integrated rate laws
- differential rate laws
* Too hot in here
Thermal ethane dehydrogenation, which you studied in the last homework, occurs at high $T$ and is plagued by the generation of ``coke,'' or a cake of primarily carbon. An alternative way to create ethylene is through oxidative dehydrogenation:
#+BEGIN_CENTER
\ce{ C2H6 (g) + O2 (g) -> C2H4(g) + H2O (g) }
#+END_CENTER
\noindent At \SI{600}{K} over some catalyst the reaction is half-order in ethane, first-order in \ce{O2}, zero order in products, and has a pseudohomogeneous rate constant of 5.0 $\text{M}^{-1/2}\text{s}^{-1}$. (Note, I am completely making this up!) You plan to run the reaction in an isothermal, constant volume reactor starting with an 70:20:10 mixture of \ce{N2}:\ce{C2H6}:\ce{O2} at \SI{2}{bar} total pressure.

** Plot the rate of disappearance of \ce{C2H6} and of \ce{O2} vs \ce{C2H6} conversion (don't forget to balance the reaction!).

** Plot the concentrations of all species vs residence time in the reactor.  

* Not a laughing matter
Nitrous oxide (\ce{N2O}) decomposes to \ce{N2} and \ce{O2} at high temperature. Experiments were performed at constant $T$ in a constant volume batch reactor. You can assume the reaction rate has the form $k P_{\ce{N2O}}^a$.

|-------------------------+---------+---------------|
| $P_{\ce{N2O},0}$ (torr) | $T$ (K) | half-life (s) |
|-------------------------+---------+---------------|
|                    82.5 |    1030 |           860 |
|                     139 |    1030 |           470 |
|                     296 |    1030 |           255 |
|                     360 |    1030 |           212 |
|                     345 |    1085 |            53 |
|                     360 |    1030 |           212 |
|                     294 |     967 |          1520 |
|-------------------------+---------+---------------|
** What is the reaction order?
** What is the apparent activation energy?

* I'm getting dehydrated
/tert/-butanol can be dehydrated to isobutylene over an ion-exchange resin. An experiment was performed to follow the concentration of butanol vs time at 338 K. You can assume the reaction rate is only dependent on the concentration of /tert/-butanol under these reaction conditions.

|----------+-------------|
| Time (h) | Butanol (M) |
|----------+-------------|
|        0 |        1.00 |
|     0.25 |        0.94 |
|     0.50 |        0.90 |
|     0.70 |        0.86 |
|     1.10 |        0.80 |
|     1.50 |        0.72 |
|     1.90 |        0.66 |
|     2.50 |        0.59 |
|     3.00 |        0.55 |
|     4.00 |        0.43 |
|     5.10 |        0.35 |
|     6.00 |        0.28 |
|----------+-------------|

** Write down the balanced reaction.

** What is the reaction order?

** What is the rate constant at this temperature?

* Pressure packed
\ce{NH3} synthesis from \ce{N2} and \ce{H2} was studied in a constant volume reactor (0.315 l) over a Ru catalyst, in a clever setup in which the \ce{NH3} was continuously removed from the reactor.  The total pressure in the reactor was followed vs time at three different compositions and at \SI{350}{\celsius}. The pressures are reported as their equivalent values at 298 K (ie $N/V = P/R\times \SI{298}{K}$).

#+BEGIN_CENTER
\ce{N2}:\ce{H2}:\ce{He} = 3:1:0
#+END_CENTER
|-----------------+-------+-------+-------+-------+-------|
| Pressure (torr) | 766.2 | 731.9 | 711.9 | 686.2 | 661.5 |
| Time (min)      |     0 |    18 |    30 |    42 |    54 |
|-----------------+-------+-------+-------+-------+-------|

#+BEGIN_CENTER
\ce{N2}:\ce{H2}:\ce{He} = 1:1:2
#+END_CENTER
|-----------------+-------+-------+-------+-------+-------|
| Pressure (torr) | 753.4 | 737.5 | 726.6 | 709.5 | 700.3 |
| Time (min)      |     0 |    15 |    30 |    45 |    54 |
|-----------------+-------+-------+-------+-------+-------|

#+BEGIN_CENTER
\ce{N2}:\ce{H2}:\ce{He} = 1:3:0
#+END_CENTER
|-----------------+-------+-------+-------+-------+-------|
| Pressure (torr) | 707.1 | 700.2 | 693.2 | 683.5 | 675.5 |
| Time (min)      |     0 |    15 |    30 |    45 |    55 |
|-----------------+-------+-------+-------+-------+-------|

** Write down the balanced reaction.

** Plot the \ce{N2} and \ce{H2} concentrations (mol/vol) vs time for each initial condition.

** Use finite differences to make a table of reaction rates (moles/time/volume) vs composition (mol/vol \ce{N2} and \ce{H2}).

** Use your rate data to determine a rate law and rate constant for the reaction at these conditions.
